# Contrib data from Standford DIME

## Downloading the contribuation list from Stanford DIME
https://data.stanford.edu/dime

In [3]:
import gdown

# downloading the contribDB_2014.csv of size 10GB
# https://drive.google.com/file/d/0B5SFXStyeVhrb1JnaVYzT2p6WWM/view?usp=drive_link&resourcekey=0-WEXQFkUpA46AEUev_ucR7w

url = 'https://drive.google.com/uc?id=0B5SFXStyeVhrb1JnaVYzT2p6WWM'
output = 'contribDB_2014.csv'
gdown.download(url, output, quiet=False)

Downloading...
From (uriginal): https://drive.google.com/uc?id=0B5SFXStyeVhrb1JnaVYzT2p6WWM
From (redirected): https://drive.google.com/uc?id=0B5SFXStyeVhrb1JnaVYzT2p6WWM&confirm=t&uuid=ea39d9a7-d0c7-4ad9-96f4-19fa6fce79fb
To: /home/distill1994/ethnicolor/data/dime/contribDB_2014.csv
100%|██████████| 10.7G/10.7G [15:47<00:00, 11.3MB/s]

'contribDB_2014.csv'

In [4]:
# peaking first 10 rows
!head -10 contribDB_2014.csv

"cycle","transaction.id","transaction.type","amount","date","bonica.cid","contributor.name","contributor.lname","contributor.fname","contributor.mname","contributor.suffix","contributor.title","contributor.ffname","contributor.type","contributor.gender","contributor.address","contributor.city","contributor.state","contributor.zipcode","contributor.occupation","contributor.employer","is.corp","recipient.name","bonica.rid","recipient.party","recipient.type","recipient.state","seat","election.type","latitude","longitude","gis.confidence","contributor.district.90s","contributor.district.00s","contributor.district.10s","censustract","efec.memo","efec.memo2","efec.transaction.id.orig","bk.ref.transaction.id","efec.org.orig","efec.comid.orig","efec.form.type","excluded.from.scaling","contributor.cfscore","candidate.cfscore"
2014,"CA:1424021_INC634_2014_1_","15",1789.15,"2013-11-19",3836518376,"state of california","","","","","","","C","","","sacramento","ca",95814,"","","","yes on prop 93, a coalition of business, labor, teachers, lawmakers, public safety and assemblymembers de leon, nunez, b","comm9995154","NA","COMM","CA","state:ballot","",38.580173,-121.506897,0.688,"CA05","CA05","CA06","06067000700","",,"INC634","","","","I",1,-0.36,-0.87
2014,"CA:1436949_INC342_2014_0_","15",408.26,"2009-01-07",32780584235,"golden state business bank","","","","","","","C","","","upland","ca",91786,"","","corp","brulte, jim","cand27195","200","CAND","CA","state:office","",34.105282,-117.662033,1,"CA41","CA26","CA31","06071000824","",,"INC342","","","","I",1,0.05,0.03
2014,"CA:1436949_INC343_2014_0_","15",842.06,"2009-01-12",32780584235,"golden state business bank","","","","","","","C","","","upland","ca",91786,"","","corp","brulte, jim","cand27195","200","CAND","CA","state:office","",34.105282,-117.662033,1,"CA41","CA26","CA31","06071000824","",,"INC343","","","","I",1,0.05,0.03
2014,"CA:1436949_INC352_2014_0_","15",230.53,"2009-01-21",3839554438,"arrowhead credit union","","","","","","","C","","","san bernardino","ca",92402,"","","","brulte, jim","cand27195","200","CAND","CA","state:office","",34.06741,-117.283325,0.805,"CA42","CA41","CA31","06071012400","",,"INC352","","","","I",1,-0.05,0.03
2014,"CA:1436949_INC356_2014_0_","15",409.44,"2009-02-07",32780584235,"golden state business bank","","","","","","","C","","","upland","ca",91786,"","","corp","brulte, jim","cand27195","200","CAND","CA","state:office","",34.105282,-117.662033,1,"CA41","CA26","CA31","06071000824","",,"INC356","","","","I",1,0.05,0.03
2014,"CA:1436949_INC358_2014_0_","15",141.75,"2009-01-31",3839554438,"arrowhead credit union","","","","","","","C","","","san bernardino","ca",92402,"","","","brulte, jim","cand27195","200","CAND","CA","state:office","",34.06741,-117.283325,0.805,"CA42","CA41","CA31","06071012400","",,"INC358","","","","I",1,-0.05,0.03
2014,"CA:1436949_INC360_2014_0_","15",2.17,"2009-01-31",3839554438,"arrowhead credit union","","","","","","","C","","","san bernardino","ca",92402,"","","","brulte, jim","cand27195","200","CAND","CA","state:office","",34.06741,-117.283325,0.805,"CA42","CA41","CA31","06071012400","",,"INC360","","","","I",1,-0.05,0.03
2014,"CA:1436949_INC362_2014_0_","15",208.7,"2009-02-26",3839554438,"arrowhead credit union","","","","","","","C","","","san bernardino","ca",92402,"","","","brulte, jim","cand27195","200","CAND","CA","state:office","",34.06741,-117.283325,0.805,"CA42","CA41","CA31","06071012400","",,"INC362","","","","I",1,-0.05,0.03
2014,"CA:1436949_INC373_2014_0_","15",370.83,"2009-03-07",32780584235,"golden state business bank","","","","","","","C","","","upland","ca",91786,"","","corp","brulte, jim","cand27195","200","CAND","CA","state:office","",34.105282,-117.662033,1,"CA41","CA26","CA31","06071000824","",,"INC373","","","","I",1,0.05,0.03

In [1]:
import pandas as pd

In [2]:
# take a small chunk, to peak data
!head -1000 data/dime/contribDB_2014.csv > data/dime/contribDB_2014_min.csv

In [5]:
df = pd.read_csv('data/dime/contribDB_2014_min.csv', engine='python')

In [6]:
df.head()

,cycle,transaction.id,transaction.type,amount,date,bonica.cid,contributor.name,contributor.lname,contributor.fname,contributor.mname,...,efec.memo,efec.memo2,efec.transaction.id.orig,bk.ref.transaction.id,efec.org.orig,efec.comid.orig,efec.form.type,excluded.from.scaling,contributor.cfscore,candidate.cfscore
0,2014,CA:1424021_INC634_2014_1_,15,1789.15,2013-11-19,3836518376,state of california,NaN,NaN,NaN,...,NaN,NaN,INC634,NaN,NaN,NaN,I,1.0,-0.36,-0.87
1,2014,CA:1436949_INC342_2014_0_,15,408.26,2009-01-07,32780584235,golden state business bank,NaN,NaN,NaN,...,NaN,NaN,INC342,NaN,NaN,NaN,I,1.0,0.05,0.03
2,2014,CA:1436949_INC343_2014_0_,15,842.06,2009-01-12,32780584235,golden state business bank,NaN,NaN,NaN,...,NaN,NaN,INC343,NaN,NaN,NaN,I,1.0,0.05,0.03
3,2014,CA:1436949_INC352_2014_0_,15,230.53,2009-01-21,3839554438,arrowhead credit union,NaN,NaN,NaN,...,NaN,NaN,INC352,NaN,NaN,NaN,I,1.0,-0.05,0.03
4,2014,CA:1436949_INC356_2014_0_,15,409.44,2009-02-07,32780584235,golden state business bank,NaN,NaN,NaN,...,NaN,NaN,INC356,NaN,NaN,NaN,I,1.0,0.05,0.03

In [7]:
df.columns

Index(['cycle', 'transaction.id', 'transaction.type', 'amount', 'date',
       'bonica.cid', 'contributor.name', 'contributor.lname',
       'contributor.fname', 'contributor.mname', 'contributor.suffix',
       'contributor.title', 'contributor.ffname', 'contributor.type',
       'contributor.gender', 'contributor.address', 'contributor.city',
       'contributor.state', 'contributor.zipcode', 'contributor.occupation',
       'contributor.employer', 'is.corp', 'recipient.name', 'bonica.rid',
       'recipient.party', 'recipient.type', 'recipient.state', 'seat',
       'election.type', 'latitude', 'longitude', 'gis.confidence',
       'contributor.district.90s', 'contributor.district.00s',
       'contributor.district.10s', 'censustract', 'efec.memo', 'efec.memo2',
       'efec.transaction.id.orig', 'bk.ref.transaction.id', 'efec.org.orig',
       'efec.comid.orig', 'efec.form.type', 'excluded.from.scaling',
       'contributor.cfscore', 'candidate.cfscore'],
      dtype='object')

## Dropping rest of the columns to reduce dataset size

In [5]:
!du -sh data/dime/contribDB_2014.csv

10G	data/dime/contribDB_2014.csv

In [44]:
# get only first name and last names
!awk -F, '{print $4","$8","$9}' data/dime/contribDB_2014.csv > data/dime/contribDB_2014_names.csv

In [45]:
!du -sh data/dime/contribDB_2014_names.csv

475M	data/dime/contribDB_2014_names.csv

In [46]:
!wc -l data/dime/contribDB_2014_names.csv

23161961 data/dime/contribDB_2014_names.csv

In [47]:
!head -10 data/dime/contribDB_2014_names.csv

"amount","contributor.lname","contributor.fname"
1789.15,"",""
408.26,"",""
842.06,"",""
230.53,"",""
409.44,"",""
141.75,"",""
2.17,"",""
208.7,"",""
370.83,"",""

In [48]:
!sed -i 's/"//g' data/dime/contribDB_2014_names.csv

In [49]:
!head -10 data/dime/contribDB_2014_names.csv

amount,contributor.lname,contributor.fname
1789.15,,
408.26,,
842.06,,
230.53,,
409.44,,
141.75,,
2.17,,
208.7,,
370.83,,

In [50]:
df = pd.read_csv('data/dime/contribDB_2014_names.csv', engine='python')

In [51]:
df.shape

(23161960, 3)

## Dropping Nan

In [52]:
df = df.dropna()

In [53]:
df.shape

(21342434, 3)

In [54]:
df.head()

   amount              contributor.lname contributor.fname
42    500   county & municipal employees    local 2620 pac
47   1000              phelps & phillips               llp
67    100                     janet gray             hayes
74    100                       thomas m            dailey
77    200                       margaret          giberson

## Dropping orgs

In [56]:
df = df.drop(df[df['contributor.lname'].str.contains("&|employee|associates|\d",regex=True)].index)

## Make title case

In [57]:
df['contributor.lname'] = df['contributor.lname'].str.title()
df['contributor.fname'] = df['contributor.fname'].str.title()

In [58]:
df.head()

   amount contributor.lname contributor.fname
67    100        Janet Gray             Hayes
74    100          Thomas M            Dailey
77    200          Margaret          Giberson
78    200         Gregory F            Hooper
79    300   William Spencer             Lewis

In [59]:
df.shape

(21325572, 3)

## Remove special characters

In [60]:
df['contributor.lname'] = df['contributor.lname'].str.replace("[^a-zA-Z' -]", '', regex=True)
df['contributor.fname'] = df['contributor.fname'].str.replace("[^a-zA-Z' -]", '', regex=True)

df['contributor.lname'] = df['contributor.lname'].str.strip()
df['contributor.fname'] = df['contributor.fname'].str.strip()

## Droping names less than 2

In [61]:
df = df.drop(df[df['contributor.lname'].str.len() < 2].index)
df = df.drop(df[df['contributor.fname'].str.len() < 2].index)

In [62]:
df.shape

(21283306, 3)

In [63]:
df[df['contributor.lname'] == 'Smith']

         amount contributor.lname contributor.fname
361683      100             Smith           Richard
364327      100             Smith            Robert
367698      100             Smith             Ralph
430992      100             Smith             Ralph
431330      100             Smith             Ralph
...         ...               ...               ...
22988014    100             Smith             Ralph
22988015    100             Smith             Ralph
23025781    100             Smith             Ralph
23025782    100             Smith             Ralph
23061393    100             Smith           Richard

[294 rows x 3 columns]

In [64]:
df[df['contributor.fname'] == 'Smith']

         amount contributor.lname contributor.fname
794         150              Jean             Smith
1105        250             Scott             Smith
1113        100              Paul             Smith
1323       6500            Gerrie             Smith
1324       2500            Gerrie             Smith
...         ...               ...               ...
23161531    270            Nicole             Smith
23161532    270              Mary             Smith
23161533    275            Brenda             Smith
23161534    270            Brenda             Smith
23161884    250          Regina L             Smith

[152473 rows x 3 columns]

## Majority of lnames and fnames are swapped

In [65]:
df['name_first'] = df['contributor.lname']
df['name_last'] = df['contributor.fname']

## Removing middle names

In [66]:
df['name_first'] = df.name_first.apply(lambda x: x.split()[0])

## find first names that has lastname ans swap

In [67]:
df.head()

   amount contributor.lname contributor.fname name_first name_last
67    100        Janet Gray             Hayes      Janet     Hayes
74    100          Thomas M            Dailey     Thomas    Dailey
77    200          Margaret          Giberson   Margaret  Giberson
78    200         Gregory F            Hooper    Gregory    Hooper
79    300   William Spencer             Lewis    William     Lewis

## Drop if first and last names are matched.

In [69]:
df[df['name_first'] == df['name_last']]

,amount,contributor.lname,contributor.fname,name_first,name_last
28494,120,Joseph M,Joseph,Joseph,Joseph
34490,120,Maung,Maung,Maung,Maung
35023,120,Hareesh,Hareesh,Hareesh,Hareesh
56121,1000,Inc Including Its Affiliated Entity The Vons C...,Inc,Inc,Inc
93277,120,Diko Androus,Diko,Diko,Diko
...,...,...,...,...,...
23028852,10,Aungkhin B,Aungkhin,Aungkhin,Aungkhin
23044344,500,Shannon,Shannon,Shannon,Shannon
23059050,100,Wei,Wei,Wei,Wei
23084390,25,Tamas,Tamas,Tamas,Tamas
23091961,25,Tamas I,Tamas,Tamas,Tamas

In [70]:
df = df.drop(df[df['name_first'] == df['name_last']].index)

In [92]:
df = df.drop(df[df['name_first'].str.len() < 2].index)
df = df.drop(df[df['name_last'].str.len() < 2].index)

In [95]:
df.head()

   amount contributor.lname contributor.fname name_first name_last
67    100        Janet Gray             Hayes      Janet     Hayes
74    100          Thomas M            Dailey     Thomas    Dailey
77    200          Margaret          Giberson   Margaret  Giberson
78    200         Gregory F            Hooper    Gregory    Hooper
79    300   William Spencer             Lewis    William     Lewis

In [115]:
last_names = df['name_last'].value_counts().loc[lambda x: x>10000].reset_index()['name_last'].values
first_names = df['name_first'].value_counts().loc[lambda x: x>10000].reset_index()['name_first'].values

In [123]:
df['full_name'] = df['name_last'] + ' ' + df['name_first']

In [124]:
df.head()

,amount,contributor.lname,contributor.fname,name_first,name_last,full_name
67,100,Janet Gray,Hayes,Janet,Hayes,Hayes Janet
74,100,Thomas M,Dailey,Thomas,Dailey,Dailey Thomas
77,200,Margaret,Giberson,Margaret,Giberson,Giberson Margaret
78,200,Gregory F,Hooper,Gregory,Hooper,Hooper Gregory
79,300,William Spencer,Lewis,William,Lewis,Lewis William

In [132]:
df['amount'] = df['amount'].apply(lambda x: pd.to_numeric(x, errors='coerce'))

In [133]:
df.shape

(21086687, 6)

In [134]:
df.dropna(inplace=True)

In [135]:
df.shape

(21086682, 6)

In [137]:
df.groupby(['full_name','amount'], as_index=False)['amount'].agg(['sum'])

                          full_name  amount    sum
0                   A Anderson Nate     0.5    1.0
1                   A Anderson Nate     3.5    3.5
2                   A Anderson Nate     5.0   20.0
3                   A Anderson Nate    35.0  280.0
4                 A Antipolo Aurora     5.0    5.0
...                             ...     ...    ...
6295576               Zyzanski Greg    20.0   20.0
6295577            Zyzanski Gregory    10.0   20.0
6295578               Zyzda Marilyn     5.0    5.0
6295579  Zzzzzzzzzzzjohnson Kenneth     1.5    1.5
6295580  Zzzzzzzzzzzjohnson Kenneth    15.0   15.0

[6295581 rows x 3 columns]

In [139]:
sdf = df.groupby(['full_name'], as_index=False)['amount'].agg(['sum'])

In [141]:
sdf.head()

           full_name     sum
0    A Anderson Nate   304.5
1  A Antipolo Aurora     5.0
2     A Baird Thomas   600.0
3  A Balaban Stephen  1024.0
4    A Bean Jennifer    55.0

In [142]:
cdf = df.groupby(['full_name'], as_index=False)['amount'].agg(['count'])

In [143]:
cdf.head()

           full_name  count
0    A Anderson Nate     15
1  A Antipolo Aurora      1
2     A Baird Thomas      2
3  A Balaban Stephen      1
4    A Bean Jennifer      2

In [144]:
print(cdf.shape)
print(sdf.shape)

(2016797, 2)
(2016797, 2)

In [149]:
x = "A Anderson Nate"

In [146]:
final_df = pd.merge(sdf, cdf, on=['full_name'])

In [147]:
final_df.shape

(2016797, 3)

In [155]:
final_df['full_name'] = final_df['full_name'].apply(lambda x : ' '.join([i for i in x.split() if len(i) > 2]))

In [156]:
final_df.head()

         full_name     sum  count
0    Anderson Nate   304.5     15
1  Antipolo Aurora     5.0      1
2     Baird Thomas   600.0      2
3  Balaban Stephen  1024.0      1
4    Bean Jennifer    55.0      2

In [166]:
final_df.shape

(2016797, 3)

In [168]:
final_df.dropna(inplace=True)

In [169]:
final_df.shape

(2016556, 3)

In [179]:
final_df = final_df.drop(final_df[final_df['full_name'].str.contains("Professional|Advocate|Employee|Assoc|Sponsored",regex=True)].index)

In [181]:
final_df.shape

(2016464, 3)

In [182]:
final_df.to_csv("data/dime/contribDB_2014_final.csv", index=False)